tap "olets/tap"

brew "ghq"
brew "peco"
brew "lazygit"
brew "neovim"
brew "olets/tap/zsh-abbr@6"
brew "zsh-autosuggestions"
brew "gh"
brew "mise"

cask "codex"
cask "karabiner-elements"
cask "rancher"
cask "slack"
cask "wezterm"
cask "font-jetbrains-mono"
cask "font-udev-gothic-nf"
