tap "go-task/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# GNU multiple precision arithmetic library
brew "gmp"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# NaCl networking and cryptography library
brew "libsodium"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplistic interactive filtering tool
brew "peco"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Autoformat shell script source code
brew "shfmt"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Web browser focusing on privacy
cask "brave-browser"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
cask "font-agave"
cask "font-hackgen"
cask "font-ipafont"
cask "font-jetbrains-mono"
cask "font-victor-mono"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customiser
cask "karabiner-elements"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "codeparrot-ai.codeparrot"
vscode "coderabbit.coderabbit-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "openai.chatgpt"
vscode "saoudrizwan.claude-dev"
vscode "vscodevim.vim"
